IDEA StatiCa Open Model
MatPrestressSteelEc2.DiagramType Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of diagram
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReinfDiagramType DiagramType { get; set; }
Public Property DiagramType As ReinfDiagramType
	Get
	Set
public:
property ReinfDiagramType DiagramType {
	ReinfDiagramType get ();
	void set (ReinfDiagramType value);
}
Property Value
Type: ReinfDiagramType
See Also
Reference
MatPrestressSteelEc2 Class
IdeaRS.OpenModel.Material Namespace